# DocumentSavedEventArgs Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentSavedEventArgs Class
Members See Also
---
The event arguments used by the DocumentSaved event.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010
# Syntax
C#
---
```text
public class DocumentSavedEventArgs : RevitAPIPostDocEventArgs
```

Visual Basic
---
```text
Public Class DocumentSavedEventArgs _
	Inherits RevitAPIPostDocEventArgs
```

Visual C++
---
```text
public ref class DocumentSavedEventArgs : public RevitAPIPostDocEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPostEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPostDocEventArgs Autodesk.Revit.DB.Events..::..DocumentSavedEventArgs
# See Also
DocumentSavedEventArgs Members
Autodesk.Revit.DB.Events Namespace